d = {'А': 'A', 'Б': 'B', 'В': 'V',
     'Г': 'G', 'Д': 'D', 'Е': 'E',
     'Ё': 'E', 'Ж': 'ZH', 'З': 'Z',
     'И': 'I', 'Й': 'I', 'К': 'K',
     'Л': 'L', 'М': 'M', 'Н': 'N',
     'О': 'O', 'П': 'P', 'Р': 'R',
     'С': 'S', 'Т': 'T', 'У': 'U',
     'Ф': 'F', 'Х': 'KH', 'Ц': 'TC',
     'Ч': 'CH', 'Ш': 'SH', 'Щ': 'SHCH',
     'Ъ': '', 'Ы': 'Y', 'Ь': '',
     'Э': 'E', 'Ю': 'IU', 'Я': 'IA'}
s = input()
r = ''
for c in s:
    if c in d:
        r += d[c].capitalize()
    elif c.upper() in d:
        r += d[c.upper()].lower()
    else:
        r += c
print(r)
